src/Catalogs/Спец_Базы/Спец_Базы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Спец_Базы</name>
  <comment>Содержит информацию по другим базам для обменов</comment>
  <predefined>
    <items>
      <name>АптекаA</name>
      <description>Аптека A</description>
    </items>
    <items>
      <name>АптекаB</name>
      <description>Аптека B</description>
    </items>
    <items>
      <name>Бухгалтерия</name>
      <description>Бухгалтерия</description>
    </items>
    <items>
      <name>Заказы</name>
      <description>Заказы</description>
    </items>
    <items>
      <name>ЗарплатаИУправлениеПерсоналом</name>
      <description>Зарплата и управление персоналом</description>
    </items>
    <items>
      <name>КартыАптечество</name>
      <description>Карты Аптечество</description>
    </items>
    <items>
      <name>КартыФармани</name>
      <description>Карты Фармани</description>
    </items>
    <items>
      <name>МДЛП</name>
      <description>МДЛП</description>
    </items>
    <items>
      <name>Оптика</name>
      <description>Оптика</description>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Управление справочниками</description>
    </items>
    <items>
      <name>ЕМИАС</name>
      <description>ЕМИАС</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресFTPДляОбменов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервераИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидБазы</name>
    <type>
      <types>EnumRef.Спец_ВидыБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключитьОбмен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийПутьКаталогаFTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписыватьНапрямуюПриОбменах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапускатьОбменыИзБазыОтправителя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапускатьОбменыИзБазыПолучателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапускатьПолноеОбновлениеТаблиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБольшихОбъектовДляОбработкиОбменов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитОбъектовДляОбмена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбмениватьЧерезFTP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменыЧерезФоновыеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортКластераИБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьДоступностьБаз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьФайловВеб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПодключенияКБазеДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазыДанных</name>
    <type>
      <types>EnumRef.Спец_ТипыБазыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьГУИДыВОтдельномРегистре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>HTTP</name>
    <attributes>
      <name>ЭтоЛокальныйАдрес</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пароль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаймаутДлинный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаймаутКороткий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьЗащищенныйПротокол</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщееНаименованиеПубликации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Спец_Базы/ObjectModule.bsl
// @strict-types

// ++ Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ПометкаУдаления Тогда
		ВключитьОбмен = Ложь;
	КонецЕсли;
	
	// Чистим адреса FTP
	АдресFTPДляОбменов = СтрЗаменить(АдресFTPДляОбменов, "\", "/");
	Если СтрЗаканчиваетсяНа(АдресFTPДляОбменов, "/") Тогда
		АдресFTPДляОбменов = Лев(АдресFTPДляОбменов, СтрДлина(АдресFTPДляОбменов) - 1);
	КонецЕсли;

	ВнутреннийПутьКаталогаFTP = СтрЗаменить(ВнутреннийПутьКаталогаFTP, "\", "/");
	Если СтрНачинаетсяС(ВнутреннийПутьКаталогаFTP, "/") Тогда
		ВнутреннийПутьКаталогаFTP = Прав(ВнутреннийПутьКаталогаFTP, СтрДлина(ВнутреннийПутьКаталогаFTP) - 1);
	КонецЕсли;
	Если СтрЗаканчиваетсяНа(ВнутреннийПутьКаталогаFTP, "/") Тогда
		ВнутреннийПутьКаталогаFTP = Лев(ВнутреннийПутьКаталогаFTP, СтрДлина(ВнутреннийПутьКаталогаFTP) - 1);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
// -- Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя
